nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/bubble_peripheral/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_2_MASK 0x04u /*!<@brief Pull Resistor Enable Bits Mask for item 2. */
#define GPIO_PUR_PU_3_MASK 0x08u /*!<@brief Pull Resistor Enable Bits Mask for item 3. */
#define PUR_PU_2_ENABLED 0x04u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_3_ENABLED 0x08u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF2 (number 60), U11[4]/I2C_SCL1
  @{ */
#define BOARD_ACCEL_MAGNET_SCL_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_ACCEL_MAGNET_SCL_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define BOARD_ACCEL_MAGNET_SCL_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOF3 (number 61), U11[6]/I2C_SDA1
  @{ */
#define BOARD_ACCEL_MAGNET_SDA_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_ACCEL_MAGNET_SDA_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define BOARD_ACCEL_MAGNET_SDA_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOF8 (number 6), USER_LED1
  @{ */
#define BOARD_LED_RED_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_RED_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_LED_RED_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define GPIO_PUR_PU_2_MASK 0x04u /*!<@brief Pull Resistor Enable Bits Mask for item 2. */
#define GPIO_PUR_PU_3_MASK 0x08u /*!<@brief Pull Resistor Enable Bits Mask for item 3. */
#define PUR_PU_2_ENABLED 0x04u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_3_ENABLED 0x08u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOF2 (number 60), U11[4]/I2C_SCL1
  @{ */
#define ACCEL_INITPINS_ACCEL_MAGNET_SCL_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_ACCEL_MAGNET_SCL_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define ACCEL_INITPINS_ACCEL_MAGNET_SCL_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name GPIOF3 (number 61), U11[6]/I2C_SDA1
  @{ */
#define ACCEL_INITPINS_ACCEL_MAGNET_SDA_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_ACCEL_MAGNET_SDA_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define ACCEL_INITPINS_ACCEL_MAGNET_SDA_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Accel_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
